In [1]:
import pandas as pd
import numpy as np

## 1. Task name - Data inspection
Load a CSV file into a pandas dataframe, and then inspect the first few rows and last few rows of the dataframe using head() and tail()

In [4]:
data1=pd.read_csv("namesandscores.csv")
data1

                  Name  Score
0           Mira Ahmed     46
1      Harry Zimmerman     63
2       Ariyah Charles     62
3         Conrad Roman     25
4         Astrid David     50
5        Alonso Hodges     76
6         Eve Schwartz     91
7      Edwin Dickerson     73
8            Opal Lynn      2
9   Zechariah Saunders     24
10      Meadow Gilmore     32
11       Vihaan Macias     62
12       Adley Mahoney     12
13        Kamryn James     46
14       Quinn Goodman     32
15      Philip Nichols     74
16    Aliyah Stevenson     74
17     Callan Mitchell     30
18     Willow Delacruz     79

In [5]:
print(data1.head())

              Name  Score
0       Mira Ahmed     46
1  Harry Zimmerman     63
2   Ariyah Charles     62
3     Conrad Roman     25
4     Astrid David     50

In [6]:
print(data1.tail())

                Name  Score
14     Quinn Goodman     32
15    Philip Nichols     74
16  Aliyah Stevenson     74
17   Callan Mitchell     30
18   Willow Delacruz     79

## 2. Task Name: Simple Data Filtering
- Description: Given a dataset, filter rows based on a specific condition,
e.g., filter and display all rows where a certain column's value is above a
threshold.

In [7]:
data1[data1.Score > 50]

                Name  Score
1    Harry Zimmerman     63
2     Ariyah Charles     62
5      Alonso Hodges     76
6       Eve Schwartz     91
7    Edwin Dickerson     73
11     Vihaan Macias     62
15    Philip Nichols     74
16  Aliyah Stevenson     74
18   Willow Delacruz     79

## 3. Task Name: Data Aggregation
- Description: Calculate summary statistics like mean, median, and
standard deviation for numeric columns in a dataset using Pandas'
aggregation functions.

In [8]:
data1['Score'].mean()

50.1578947368421

In [9]:
data1['Score'].median()

50.0

In [10]:
data1['Score'].std()

25.237236945731016

## 4. Task Name: Joining DataFrames
- Description: Given two or more datasets, perform different types of
joins (inner, outer, left, right) between them using Pandas' `merge()`
function.

In [11]:
data2=pd.read_csv("rollandpd.csv")
data2

    Roll Number  Physical Disability
0              1                  No
1              2                  No
2              3                  No
3              4                  No
4              5                  No
5              6                  No
6              7                  No
7              8                 Yes
8              9                  No
9             10                  No
10            11                  No
11            12                  No
12            13                  No
13            14                  No
14            15                  No
15            16                  No
16            17                  No
17            18                 Yes
18            19                  No